MobileMoney/app/Controllers/Client/AuthController.php

SELECT *
FROM `prefixes`
SELECT *
FROM `clients`
WHERE `numero_telephone` = '0334964180'
 LIMIT 1
---
    public function login()
    {
        $numero = $this->normalizePhoneNumber($this->request->getPost('numero_telephone'));

        if ($numero === '') {
            return redirect()->back()->with('error', 'Veuillez entrer un numéro de téléphone.');
        }

        if (! $this->isValidPhoneNumber($numero)) {
            return redirect()->back()->with('error', 'Le numéro doit contenir 10 chiffres.');
        }

        $prefixes = array_map(static fn (array $row) => $row['code'], \Config\Database::connect()->table('prefixes')->get()->getResultArray());
        $isValidPrefix = false;

        foreach ($prefixes as $prefix) {
            if (str_starts_with($numero, $prefix)) {
                $isValidPrefix = true;
                break;
            }
        }

        if (! $isValidPrefix) {
            return redirect()->back()->with('error', 'Le numéro ne correspond à aucun préfixe autorisé.');
        }

        $clientModel = new ClientModel();
        $client = $clientModel->where('numero_telephone', $numero)->first();