MobileMoney/app/Controllers/Client/DashboardController.php

UPDATE `clients` SET `solde` = 500000
WHERE `clients`.`id` IN (2)
INSERT INTO `transactions` (`id_client`, `id_type_operation`, `montant`, `frais`) VALUES (2, 1, 500000, 0)
---
    private function processSingleOperation(string $operationName)
    {
        $client = $this->requireClient();
        $montant = $this->request->getPost('montant');

        if (! is_numeric($montant) || (float) $montant <= 0) {
            return redirect()->back()->with('error', 'Le montant est invalide.');
        }

        $operation = $this->getOperationType($operationName);
        if (! $operation) {
            return redirect()->back()->with('error', 'Type d’opération introuvable.');
        }

        $amount = (float) $montant;
        $fee = $this->resolveFee((int) $operation['id'], $amount);
        $newBalance = $this->applyBalanceChange((float) $client['solde'], $amount, $fee, $operationName);

        if ($newBalance === null) {
            return redirect()->back()->with('error', 'Solde insuffisant.');
        }

        $db = \Config\Database::connect();
        $db->transStart();

        $this->clientModel->update((int) $client['id'], ['solde' => $newBalance]);
        $this->transactionModel->insert([
            'id_client' => (int) $client['id'],
            'id_type_operation' => (int) $operation['id'],
            'montant' => $amount,
            'frais' => $fee,
        ]);

SELECT *
FROM `tranches_frais`
WHERE `id_type_operation` = 1
AND `montant_min` <= 500000
AND `montant_max` >= 500000
ORDER BY `montant_min` DESC
---
    private function resolveFee(int $typeOperationId, float $amount): float
    {
        $row = \Config\Database::connect()->table('tranches_frais')
            ->where('id_type_operation', $typeOperationId)
            ->where('montant_min <=', $amount)
            ->where('montant_max >=', $amount)
            ->orderBy('montant_min', 'DESC')
            ->get()
            ->getRowArray();

SELECT *
FROM `types_operation`
---
    private function getOperationType(string $name): ?array
    {
        $types = \Config\Database::connect()->table('types_operation')->get()->getResultArray();

SELECT `transactions`.*, `types_operation`.`nom` AS `operation_nom`
FROM `transactions`
LEFT JOIN `types_operation` ON `types_operation`.`id` = `transactions`.`id_type_operation`
WHERE `transactions`.`id_client` = 2
ORDER BY `transactions`.`date_transaction` DESC
 LIMIT 20
---
    private function getHistory(int $clientId): array
    {
        return \Config\Database::connect()->table('transactions')
            ->select('transactions.*, types_operation.nom AS operation_nom')
            ->join('types_operation', 'types_operation.id = transactions.id_type_operation', 'left')
            ->where('transactions.id_client', $clientId)
            ->orderBy('transactions.date_transaction', 'DESC')
            ->limit(20)
            ->get()
            ->getResultArray();

SELECT *
FROM `clients`
WHERE `clients`.`id` = 2
---
    private function requireClient(): array
    {
        $clientId = (int) session()->get('client_id');

        if ($clientId <= 0) {
            redirect()->to('/auth')->with('error', 'Veuillez vous connecter.')->send();
            exit;
        }

        $client = $this->clientModel->find($clientId);